nanoframework/nf-interpreter/targets/FreeRTOS_ESP32/ESP32_WROOM_32/nanoCLR/targetHAL_Time.cpp
//
// Copyright (c) .NET Foundation and Contributors
// See LICENSE file in the project root for full license information.
//

#include <nanoHAL.h>
#include <nanoHAL_Types.h>
#include <nanoCLR_Types.h>
#include <nanoHAL_Time.h>
#include <target_platform.h>
#include <esp32_os.h>

#define TIME_CONVERSION__TO_USECS	10

#if configUSE_16_BIT_TICKS == 0
#define TOPVALUE ((uint64_t)0x100000000ull)
#elif configUSE_16_BIT_TICKS == 1
#define TOPVALUE ((uint64_t)0x10000ull)
#else
#error "Tick resolution not supported."
#endif

uint64_t HAL_Time_CurrentSysTicks(void)
{

    static uint64_t extendedCounter = 0;
    static uint32_t prevKernelTick = 0;
    uint32_t kernelTick = 0;

    // Check if we have overflow during this call
    // It is assumed that this function gets called twice within its overflow range
    // (e.g. for 32-bit counter this is 49.71 days)
    GLOBAL_LOCK();
    {
        kernelTick = xTaskGetTickCountFromISR();

        if (prevKernelTick > kernelTick)
        {
            extendedCounter += TOPVALUE;
        }
        prevKernelTick = kernelTick;
    }
    GLOBAL_UNLOCK();

    return extendedCounter + kernelTick;
}

// Returns the current date time from the RTC 
uint64_t  HAL_Time_CurrentDateTime(bool datePartOnly)
{
    SYSTEMTIME st; 
 
    struct timeval tv;

    gettimeofday(&tv, NULL);

    // Convert from Unix time(year since 1900) to SYSTEMTIME(Years since 1601)
	int64_t time = ((int64_t)tv.tv_sec * (int64_t)TIME_CONVERSION__TO_SECONDS) + ((int64_t)tv.tv_usec * (int64_t)TIME_CONVERSION__TO_USECS) + TIME_UNIX_EPOCH_AS_TICKS;

    // zero 'time' fields if date part only is required
    if(datePartOnly)
    {
        HAL_Time_ToSystemTime(time, &st);

        st.wMilliseconds = 0;
        st.wSecond = 0;
        st.wMinute = 0;
        st.wHour = 0;

        time = HAL_Time_ConvertFromSystemTime(&st);
    }

    return time;
};

void HAL_Time_SetUtcTime(uint64_t utcTime)
{
    SYSTEMTIME systemTime;

    HAL_Time_ToSystemTime(utcTime, &systemTime);

    struct tm newTime;

    newTime.tm_year = systemTime.wYear - 1900;      // years since 1900
    newTime.tm_mon = systemTime.wMonth - 1;         // months since January 0-11
    newTime.tm_mday = systemTime.wDay;              // day of the month 1-31
    newTime.tm_wday = systemTime.wDayOfWeek;        // days since Sunday 0-6
    newTime.tm_hour = (uint32_t)systemTime.wHour;   // hours since midnight 0-23
    newTime.tm_min = (uint32_t)systemTime.wMinute;  // minutes after the hour 0-59
    newTime.tm_sec = (uint32_t)systemTime.wSecond;  // seconds after the minute	 0-59

    time_t t = mktime(&newTime);
    struct timeval now = { .tv_sec = t, .tv_usec = 0 };
    settimeofday(&now, NULL);
}

bool HAL_Time_TimeSpanToStringEx( const int64_t& ticks, char*& buf, size_t& len )
{
    uint64_t ticksAbs;
    uint64_t rest;

    if(ticks < 0)
    {
        ticksAbs = -ticks;

        CLR_SafeSprintf( buf, len, "-" );
    }
    else
    {
        ticksAbs = ticks;
    }

    rest      = ticksAbs % ( 1000 * TIME_CONVERSION__TICKUNITS);
    ticksAbs  = ticksAbs / ( 1000 * TIME_CONVERSION__TICKUNITS);  // Convert to seconds.

    if(ticksAbs > TIME_CONVERSION__ONEDAY) // More than one day.
    {
        CLR_SafeSprintf( buf, len, "%d.", (int32_t)(ticksAbs / TIME_CONVERSION__ONEDAY) ); ticksAbs %= TIME_CONVERSION__ONEDAY;
    }

    CLR_SafeSprintf( buf, len, "%02d:", (int32_t)(ticksAbs / TIME_CONVERSION__ONEHOUR)  ); ticksAbs %= TIME_CONVERSION__ONEHOUR  ;
    CLR_SafeSprintf( buf, len, "%02d:", (int32_t)(ticksAbs / TIME_CONVERSION__ONEMINUTE)); ticksAbs %= TIME_CONVERSION__ONEMINUTE;
    CLR_SafeSprintf( buf, len, "%02d" , (int32_t)(ticksAbs / TIME_CONVERSION__ONESECOND)); ticksAbs %= TIME_CONVERSION__ONESECOND;

    ticksAbs = (uint32_t)rest;
    if(ticksAbs)
    {
        CLR_SafeSprintf( buf, len, ".%07d", (uint32_t)ticksAbs );
    }

    return len != 0;
}

bool DateTimeToString(const int64_t& time, char*& buf, size_t& len )
{
    SYSTEMTIME st;

    HAL_Time_ToSystemTime( time, &st );

    return CLR_SafeSprintf(buf, len, "%4d/%02d/%02d %02d:%02d:%02d.%03d", st.wYear, st.wMonth, st.wDay, st.wHour, st.wMinute, st.wSecond, st.wMilliseconds );
}

char* DateTimeToString(const int64_t& time)
{
    static char rgBuffer[128];
    char*  szBuffer =           rgBuffer;
    size_t iBuffer  = ARRAYSIZE(rgBuffer);

    DateTimeToString( time, szBuffer, iBuffer );

    return rgBuffer;
}

const char* HAL_Time_CurrentDateTimeToString()
{
    return DateTimeToString(HAL_Time_CurrentDateTime(false));
}

uint64_t CPU_MillisecondsToTicks(uint64_t ticks)
{
    return ESP32_TICKS_PER_MS(ticks);
}
